app/controllers/tweets_controller.rb

  def category
    @data = TweetCategory.all
---
SELECT "tweet_categories".* FROM "tweet_categories"

  def set_a
    @twee = Tweet.where(tweet_category_id: $global_var)
---
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."tweet_category_id" IN (15)  ORDER BY "tweets"."id" DESC LIMIT 1